if [ "$2" = "+" ] || [ "$2" = "-" ] || [ "$2" = "*" ] || [ "$2" = "/" ]; then
    case "$2" in
        "+")
            result=$(($1 + $3))
            ;;
        "-")
            result=$(($1 - $3))
            ;;
        "*")
            result=$(($1 * $3))
            ;;
        "/")
            if [ "$3" = 0 ]; then
                result="Ошибка. Деление на ноль"
            else
                result=$(($1 / $3))
            fi
            ;;
    esac
    echo "Результат: $result"
else
    echo "Ошибка. Неверное выражение"
fi